openfoam/0/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
62478
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    oversetPatchRight
    {
        type            overset;
        value           uniform 1;
    }
    oversetPatchLeft
    {
        type            overset;
        value           uniform 2;
    }
    topAndBottom
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    airfoilRight
    {
        type            zeroGradient;
    }
    airfoilLeft
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
